app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."id" IS NULL LIMIT ?  [["email", "carmen@gmail.com"], ["LIMIT", 1]]
---
	def create
		puts params
		user = User.find_by(email: params[:session][:email])